 [
  {
  "cropName": "Asparagus",
  "coEfficients": {
  "init": 0.3,
  "mid": 0.95,
  "end": 0.3
  },
  "Type": "Vegetable",
  "Image": "Asparagus.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Sandy, Fertile, well drained, and free of persistent weeds",
  "soilpH": "Slightly Acidic to Neutral",
  "plant" : "Set out dormant 1-year old roots, called crowns, in late winter or early spring. A few varieties can be grown from seed.",
  "feeding" : "mulch with 2 inches of rich compost or rotted manure every winter",
  "spacing" : "Single Plants:(45cm) each way (minimum) Rows:(45cm) with (45cm) row gap (minimum)",
  "notes" : "After the stems die back in early winter, cut them off at ground level and compost them. Remove weeds, apply compost and mulch, and your yearly maintenance is done.",
  "harvesting" : "Begin gathering spears the second year after planting, cutting all spears that appear for a month in early spring. In subsequent years, harvest for 6 weeks each spring."
  },
  
  {
  "cropName": "Beets",
  "coEfficients": {
  "init": 0.5,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Beets.jpeg",
  "sunExposure": "Full Sun, Part Sun",
  "soilType": "Loamy, Sandy",
  "soilpH": "Neutral",
  "plant" : "Sow in mid-spring, at about the time apple trees bloom. Sow fall crops in mid to late summer. Thin seedlings to at least 5 inches apart to grow large roots.",
  "feeding" : "Rarely required",
  "spacing" : "Single: Plants(15cm) each way (minimum) Rows:(10cm) with (20cm) row gap (minimum)",
  "notes" :  "Each seed is actually a multi-celled capsule, so you may need small scissors to thin plants to proper spacing. Weed carefully, and mulch between plants to deter weeds. Baby beet greens often are included in salad mixes.",
  "harvesting" : "Harvest young leaves for salad greens as you thin young plants. Pull roots when they become plump. To keep through winter, harvest plants, cut off the tops, and keep in a cool root cellar or refrigerator."
  
  },
  
  {
  "cropName": "Blueberries",
  "coEfficients": {
  "init": 0.4,
  "mid": 1.0,
  "end": 0.75
  },
  "Type": "Fruit",
  "Image": "Blueberries.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Any",
  "soilpH": "Acidic",
  "plant" : "Plant in mid-fall or early winter when it's not too cold for a little root growth to help them establish.",
  "feeding" : "May need potash (potassium) adding, particularly if the leaves start to brown at the edges.",
  "spacing" : "Single Plants: (90cm) each way (minimum) Rows:  (90cm) with  (90cm) row gap (minimum)",
  "notes" : "After harvesting prune the bush back to five leaves on each side shoot and remove any dead or overcrowded branches to 'open up' the plant.",
  "harvesting" : "Harvest fruit when ripe."
  },
  
  {
  "cropName": "Broccoli",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Broccoli.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Sandy",
  "soilpH": "Slightly Acidic to Neutral",
  "plant" : "Sow indoors in early spring, and set out while the soil is still cool. Sow fall broccoli indoors in summer, and set out when the plants are 3 weeks old.",
  "feeding" : "Mix composted manure or another high-nitrogen compost into the soil before planting. When heads begin to form, feed with a liquid plant food.",
  "spacing" : "Single Plants: (45cm) each way (minimum) Rows: (45cm) with (45cm) row gap (minimum)",
  "notes" : "Broccoli that matures in cool fall weather has an especially tender texture with sweet flavor to match.",
  "harvesting" : "Use a sharp knife to harvest the primary head when the beads are plump and well-filled. Many varieties produce numerous smaller side shoots after the primary head is cut."
  },
  
  {
  "cropName": "Cabbage",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Cabbage.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Loamy, Sandy",
  "soilpH": "Neutral",
  "plant" : "Sow late summer to move to final positions in fall to be over-wintered and ready for spring",
  "feeding" : "Drench every two weeks with an organic liquid fertilizer.",
  "spacing" : "Single Plants:(60cm) each way (minimum) Rows: (60cm) with (60cm) row gap (minimum)",
  "notes" : " Try growing different varieties from seed to explore differences in leaf color and type. Most early-maturing cabbage varieties produce smallish heads.",
  "harvesting" : "Cut heads when they reach the size you prefer. Small secondary heads often grow from the base of early cabbage plants after the primary head is cut."
  },
  
  {
  "cropName": "Carrots",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Carrots.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Sandy, Well drained soil rich in organic matter, but with no manure added prior to planting. Use well aged compost or vermicompost to condition compacted soil.",
  "soilpH": "Neutral",
  "plant" : "Sow direct into soil in spring. Make a second sowing for a fall crop in mid to late summer.",
  "feeding" : "Soil quality is more essential that supplemental feeding.",
  "spacing" : "Single Plants: (10cm) each way (minimum) Rows: (10cm) with (15cm) row gap (minimum)",
  "notes" : "keep plants well weeded to reduce competition for nutrients are water. Mulch over the tops of mature carrots to keep their shoulders from turning green.",
  "harvesting" : "Can be harvested over a long period, but the longer plants are left in the ground, the more likely they are to be injured by insects or animals."
  },
  
  {
  "cropName": "Cauliflower",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Cauliflower.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Loamy",
  "soilpH": "Slightly Acidic to Neutral",
  "plant" :"Sow indoors in early spring, and set out while the soil is still cool.",
  "feeding" : "Mix composted manure or another high-nitrogen compost into the soil before planting. When heads begin to form, feed with a liquid plant food.",
  "spacing" : "Single Plants: (50cm) each way (minimum) Rows: (45cm) with(60cm) row gap (minimum)",
  "notes" : "Cabbageworms are small green larvae of the cabbage white butterfly. You can use row covers to keep them from eating plants. Bend over a few leaves if required so that the cauliflower head is kept shaded while it is forming.",
  "harvesting" : "Harvest when the head has fully developed, but before the curd becomes loose, with a ricey appearance."
  },
  
  {
  "cropName": "Celery",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Celery.jpeg",
  "sunExposure": "Full Sun, Part Sun",
  "soilType": "Any Rich, moisture-retentive soil with plenty of compost dug in before planting.",
  "soilpH": "Neutral",
  "plant" : "Sow indoors in early spring, and set out transplants when they are big enough to handle.",
  "feeding" : "Liquid feed every two weeks throughout the season.",
  "spacing" : "Single Plants: (20cm) each way (minimum) Rows: (15cm) with (30cm) row gap (minimum)",
  "notes" :  "Garden-grown celery is looser and darker green than the supermarket version, with much more intense flavor. Provide water as needed to the soil moist in dry weather.",
  "harvesting" : "Cut individual stalks as needed in the kitchen, or pull entire plants."
  
  },
  
  {
  "cropName": "Corn",
  "coEfficients": {
  "init": 0.3,
  "mid": 1.15,
  "end": 0.4
  },
  "Type": "Vegetable",
  "Image": "Corn.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Loamy",
  "soilpH": "Neutral",
  "plant" : "Wait until the soil is warm to sow sweet corn. Soak seeds in water overnight before planting them 1 inch deep and 6 inches apart. Thin to 12 inches apart when the plants are 6 inches tall.",
  "feeding" : "Needs more nitrogen than other vegetables. Mix an organic fertilizer into the soil before planting, following label application rates. When tassels form, feed plants second time.",
  "spacing" : "Single Plants: (35cm) each way (minimum) Rows:  (30cm) with (45cm) row gap (minimum)",
  "notes" : "Plant in blocks of at least 15 plants, all the same variety, to insure good wind pollination. Keep well watered in dry spells.",
  "harvesting" : "Sweet corn is ready when the ears feel firm and full when grasped, and a test kernel pierced with a fingernail released milky juice. Harvest in the morning, and promptly refrigerate ears to help them hold their delicate sugars."
  },
  
  {
  "cropName": "Cucumber",
  "coEfficients": {
  "init": 0.6,
  "mid": 1,
  "end": 0.75
  },
  "Type": "Vegetable",
  "Image": "Cucumber.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Loamy",
  "soilpH": "Neutral",
  "plant" : "Easily grown from seeds sown directly in the ground, or start seeds indoors and set plants out when they are 3 weeks old.",
  "feeding" : "Drench with a liquid organic fertilizer when plants begin to bloom heavily.",
  "spacing" : "Single Plants:  (60cm) each way (minimum) Rows:  (60cm) with  (60cm) row gap (minimum)",
  "notes" : "Use a trellis to save space, or you can let cucumbers ramble over mulched ground.",
  "harvesting" : "Pick cucumbers at least every other day by snipping them from the vine with pruning shears. Many varieties are extremely productive. Fruits with hard seeds inside are overripe."
  },
  
  {
  "cropName": "Green onions",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Green onions.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Loamy, Sandy",
  "soilpH": "",
  "plant" : "Start seeds indoors in late winter to early spring when growing cold-hardy bunching varieties. Or, plant large sets close together and harvest the plants when young.",
  "feeding" : "Work an organic fertilizer into the soil prior to setting out seedlings or sets.",
  "spacing" : "Single Plants: (10cm) each way (minimum) Rows: (10cm) with 3 (10cm) row gap (minimum)",
  "notes" : "Any immature onion can be eaten as a green onion, or scallion.",
  "harvesting" : "Pull individual plants as you need them in the kitchen. With perennial bunching varieties, lift clumps in spring or fall and replant some of the divisions."
  },
  
  {
  "cropName": "Lettuce",
  "coEfficients": {
  "init": 0.7,
  "mid": 1,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Lettuce.jpeg",
  "sunExposure": "Part Sun",
  "soilType": "Loamy",
  "soilpH": "",
  "plant" : "Start seeds indoors in early spring, or simply sow fresh seeds where you want them to grow. Scatter seeds atop prepared soil, about one-half inch apart, and barely cover them before patting them into place. Sow more seeds in summer for a fall crop.",
  "feeding" : "Not usually required.",
  "spacing" : "Single Plants:(10cm) each way (minimum) Rows:  (10cm) with  (15cm) row gap (minimum)",
  "notes" : "As lettuce seedlings grow, thin them so that the leaves of adjoining plants do not overlap. Mulch open space between plants to retain soil moisture and prevent weeds.",
  "harvesting" : "You can pick individual leaves, use scissor or a knife to harvest handfuls of baby lettuce, or grow plants at proper spacing to get large, loose heads.",
  },
  
  {
  "cropName": "Onions",
  "coEfficients": {
  "init": 0.7,
  "mid": 1.05,
  "end": 0.95
  },
  "Type": "Vegetable",
  "Image": "Onions.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Any, Loamy",
  "soilpH": "Neutral",
  "plant" : "If you don't start your own seeds, set out sets (small dormant bulbs) or pencil-size seedlings in spring, while the soil is still cool.",
  "feeding" : "Mix a balanced organic fertilizer into the bed or row before planting your onions, taking care to get it into the soil below the plants. Do not feed plants that are nearing maturity if you want very sweet onions.",
  "spacing" : "Single Plants: (15cm) each way (minimum) Rows: (10cm) with  (20cm) row gap (minimum)",
  "notes" : "Onions respond to changing day length. Grow short-day varieties in southern latitudes. Long-day varieties work best in northern areas. Try growing different varieties from seed to explore differences in bulb color, size and shape.",
  "harvesting" : "Harvest young onions as scallions. When bulbs form and the tops of the plants fall over, pull them and cure in a warm place for about 10 days before storing."
  },
  
  {
  "cropName": "Peas",
  "coEfficients": {
  "init": 0.5,
  "mid": 1.15,
  "end": 1.1
  },
  "Type": "Vegetable",
  "Image": "Peas.jpeg",
  "sunExposure": "Full Sun, Part Sun",
  "soilType": "Loamy",
  "soilpH": "Neutral",
  "plant" : "Soak seeds in water overnight before sowing 2 inches deep and 2 inches apart. Thin plants to proper spacing after the seeds germinate.",
  "feeding" : "Not usually required if the plants are mulched deeply with grass clippings, shredded leaves, or another biodegradable material.",
  "spacing" : "Single Plants: (10cm) each way (minimum) Rows: (10cm) with (20cm) row gap (minimum)",
  "notes" : "Support plants with a trellis, which can be made from string, netting, or twiggy sticks pushed into the ground near each plant.",
  "harvesting" : "Pick snow peas when the delicate pods begin to show immature seeds inside. Gather snap peas when the pods become plump yet are still glossy and filled with sweet-tasting peas. Pick shell peas before the pods become waxy"
  },
  
  {
  "cropName": "Potato",
  "coEfficients": {
  "init": 0.5,
  "mid": 1.15,
  "end": 0.75
  },
  "Type": "Vegetable",
  "Image": "Potato.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Sandy",
  "soilpH": "Acidic",
  "plant" : "Plant 'slips' that grow from sprouting tubers in late spring or early summer, after the soil is very warm.",
  "feeding" : "Mix a light application of a balanced organic fertilizer into the soil before planting.",
  "spacing" : "Single Plants: (45cm) each way (minimum) Rows: (45cm) with  (60cm) row gap (minimum)",
  "notes" : "potatoes form a dense green ground cover under hot summer conditions. Tubers are often found 12 inches or more from the plant's primary crown, so dig carefully. Although not from the solanaceae family, sweet potatoes are often placed in that group for crop rotation purposes because they share several important pests and diseases such as wireworms and nematodes which is why we show it as solanaceae.",
  "harvesting" : "Dig in fall when the soil is still warm. Cure in a warm, airy place for two weeks before storing at cool room temperatures."
  },
  
  {
  "cropName": "Raspberries",
  "coEfficients": {
  "init": 0.4,
  "mid": 1.2,
  "end": 0.75
  },
  "Type": "Fruit",
  "Image": "Raspberries.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Any",
  "soilpH": "Slightly Acidic to Neutral",
  "plant" : "Plant in mid-fall or early winter when it's not too cold for a little root growth to help them establish.",
  "feeding" : "Not usually required.",
  "spacing" : "Single Plants:  (70cm) each way (minimum) Rows:  (60cm) with  (90cm) row gap (minimum)",
  "notes" : "After harvesting cut the canes down to ground level, leaving any new shoots.",
  "harvesting" : "Harvest fruit when ripe. Can protect with netting if birds are eating them but make sure that the plant doesn't grow through the netting making it difficult to remove."
  },
  
  {
  "cropName": "Strawberries",
  "coEfficients": {
  "init": 0.4,
  "mid": 1.05,
  "end": 0.7
  },
  "Type": "Fruit",
  "Image": "Strawberries.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Loamy, Well-drained, moderately acidic soil amended with compost.",
  "soilpH": "Slightly Acidic to Neutral",
  "plant" : "Set out plants in early spring, or in fall in mild winter areas. Take care not to bury the central crown when transplanting.",
  "feeding" :"In fall and again in early spring, topdress established plants with rich compost or an organic fertilizer. Allow plants to rest in midsummer.",
  "spacing" : "Single Plants: (60cm) each way (minimum) Rows:  (60cm) with (60cm) row gap (minimum)",
  "notes" : "Can be used as a ground cover beneath grapes or blueberries, or managed as a perpetual bed. In late summer, remove weeds and withered leaves, and thin runners to no more than 3 per plant. Lift and transplant extra runners",
  "harvesting" : "Gather ripe fruits in the morning, when they are cool, and refrigerate immediately. Wash in cool water just before eating."
  },
  
  {
  "cropName": "Watermelon",
  "coEfficients": {
  "init": 0.4,
  "mid": 1,
  "end": 0.75
  },
  "Type": "Fruit",
  "Image": "Watermelon.jpeg",
  "sunExposure": "Full Sun",
  "soilType": "Sandy, Rich soil with plenty of compost added. Often grown in widely spaced enriched hills, or in well-aged compost heaps that include some soil.",
  "soilpH": "",
  "plant" : "Sow seeds 1 inch deep in rows, or in hills spaced 6 feet apart. After 2 weeks, thin to 2 plants per hill.",
  "feeding" : "After plants set fruit, feed twice, at two week intervals, with a water soluble plant food.",
  "spacing" : "Single Plants: (90cm) each way (minimum) Rows: (90cm) with (90cm) row gap (minimum)",
  "notes" : "Fruit size varies with variety. Small icebox watermelons mature quickly and take up less space compared to huge watermelons.",
  "harvesting" : "Ripe watermelons sound deep and resonant when thumped, and the curled tendril opposite the melon should be brown. Wipe clean and store indoors."
  
  }
  ]
